W5D2/reddit/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.author_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "nested 2"], ["author_id", 1], ["post_id", 6], ["parent_comment_id", 1], ["created_at", "2017-10-31 23:27:48.041319"], ["updated_at", "2017-10-31 23:27:48.041319"]]

  def show
    @comment = Comment.find_by(id: params[:id])
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]