W5D2/reddit/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "asdf"], ["url", "asdf"], ["content", "sadf"], ["author_id", 1], ["created_at", "2017-10-31 21:36:39.079178"], ["updated_at", "2017-10-31 21:36:39.079178"]]
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save