W5D2/reddit/app/controllers/subs_controller.rb

  def edit
    @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @sub = Sub.find_by(id: params[:id])
    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "it's probably bad yep"], ["updated_at", "2017-10-31 20:48:21.861915"], ["id", 1]]