W5D2/reddit/app/views/subs/show.html.erb

SELECT  1 AS one FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1 LIMIT $2  [["sub_id", 2], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]
---
<ul>
  <% unless @sub.posts.empty? %>