W5D2/reddit/app/views/posts/_form.html.erb

SELECT "subs".* FROM "subs"
---
  <input type="hidden" name="post[sub_ids][]" value="">
  <% Sub.all.each do |sub| %>