W5D2/reddit/app/views/posts/show.html.erb

<ul>
  <% unless @post.subs.empty? %>
---
SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 LIMIT $2  [["post_id", 6], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 6]]